

# level 26:
    #  1) შექმენით სია რომელშიც მოათვსებთ 10 განსხვავებულ მანქანის სახელს,
    #  შემდეგ დაბეჭდეთ ცალ ცალკე მეორე და მეხუთე ელემენტები, 
    # დაბეჭდეთ თავიდან შუამდე ყველა ელემენტი, 
    # დაბეჭდეთ შუიდან ბოლომდე ყველა ელემენტი, 
    # დაბეჭდეთ მინუს 3 ინდექსზე და -1 ინდექსზე მდგომი ელემენტი, 
    # დაბეჭდეთ შუა სამი ელემენტი, 
    # დაბეჭდეთ მთლიანი სია


list1 = ["mercedes", "bmw", "toyota", "crv", "lamborghini", 
         "audi", "dodge", "honda", "tesla", "bugatti"]

# print(list1[2])
# print(list1[5])

# print(list1[0:6])
# print(list1[5:])

# print(list1[-3])
# print(list1[-1])

print(list1)