# 1) დაადეკლარირეთ(შექმენით) 3 ინტეჯერ ტიპის ცვლადი 
# სადაც შეინახავთ მთელ რიცხვებს და დაბეჭდავთ(print) მათ 

num1 = 306 #integer
num2 = 240
num3 = 67
print(num1 + num2 + num3)


# 2) დაადეკლარირეთ სტრინგ ტიპის ცვლადი სახელად name 
# რომელსაც მიანიჭებთ მნიშვნელობად თქვენს სახელს

name = "qetevan"  #სახელი, რომელიც ბრჭყალებშია ჩასმული არის integer.


# 3) დაადეკლარირეთ float ტიპის ცვლადი სახელად height რომელსაც მიანიჭებთ მნიშვმელობად თქვენს სიმაღლეს

height = 1.75 #float


# 4) დაადეკლარირეთ ინტეჯერ ტიპის ცვლადი სახელად x 
# რომელსაც თავდაპირველი მნიშვნელობა იქნება 15 შემდეგ მიუმატეთ 5 და ისე დაბეჭდეთ ცვლადი

x = 15
print(x + 5)


# 5) მოახდინეთ კონკატენაცია ორი სტრინგ ტიპის ცვლადის ერთში იყოს თქვემი სახელი მეორეში გვარი

name = "qetevan"
lastname = "makharashvili"
print(name + lastname)