

# 2. დაბეჭდეთ რიცხვები while loop - ის საშვალებით რიცხვები 10 დან 1 ამდე

c = 10

while 1 >= 10:
    print(c)
    c = c - 1


# 3. დაბეჭდეთ 20 ამდე რიცხვები 5,15 ის რიცხვების გამოკლებით.

c1 = 0

while c1 <= 20:
    if c1 != 5 and c1 != 15:
      print(c1)



# 4. შეიყვანე სიტყვა და for ციკლით დაბეჭდე მისი თითოეული ასო ცალ-ცალკე.

c2 = input("")

for i in c2:
    print(c2)

for i in range(c2):
    print(c2)



# 5. დაწერეთ ციკლი რომელიც ლუწს გამოიტანს " მე მიყვარს გოა" და კენტს " მე მიყვარს პროგრამირება".

c3 = int(input(""))

for i in range(0, c3):
     if c3 % 2 == 0:
         print(" მე მიყვარს გოა. ")
     else:
         print(" მე მიყვარს პროგრამირება. ")


# 6. დაბეჭდე რიცხვები 1-დან 30-მდე, და გვერდით მიუწერე "ლუწია" თუ "კენტია".

for i in range(1, 30):
     print(i)
     if i % 2:
         print(" კენტია. ")
     else:
         print(" ლუწია. ") 


# for i in range(1, 30):

#     if i % 2 == 0:
#       print(" კენტია. ")
# print(i)



# 7. დაბეჭდე 1-დან 10-მდე რიცხვები უკუღმა for ციკლით.

for i in range(10, 1, -1):
     print(i)

# 8. შექმენით input  რომელიც მომხმარებელს ეკითხება რიცხვს 
# და შემდეგ while ციკლის გამოყენებით i დაიწყებს რიცხვების დაბეჭდვსს სანამ არ მიაღწევს ნულს

c4 = int(input(""))

while c4 < 0:
     print(c4)
     c4 = c4 - 1


# 9. შეიყვანეთ რიცხვი და გამოიყენეთ while ციკლი, რომ დაბეჭდოთ ყველა რიცხვი 1-დან იმ რიცხვამდე.

c5 = int(input(""))

q = 1
while q < c5:
    print(q)
    q = q + 1


while c5 < 100:
     print(c5)
c5 = c5 + 1



# 10. შეიყვანეთ რიცხვი, ხოლო პროგრამამ უნდა დაბეჭდოს რიცხვი და შემცირდეს ერთით ყოველჯერ, 
# სანამ რიცხვი არ გახდება 0.

c6 = int(input(""))
while c6 >= 0:
    print(c6)
    c6 = c6 - 1



# 11. შეიყვანეთ რიცხვი და გამოიყენეთ while ციკლი, რათა დაბეჭდოთ რიცხვი, 
# ხოლო როდესაც რიცხვი გახდება 0, შეწყვიტეთ.

c7 = int(input(""))
while c7 > 0:
    print(c7)

# 12. დაბეჭდეთ ყველა მეხუთე რიცხვი for loop. ის გამოყენებით მაგ.(5,10,15...)

for i in range(5, 100, 5):
    print(i)


for i in range(5, 55, 5):
     print(i)



# 13. შეიყვანეთ რიცხვი და დაბეჭდეთ ყველა რიცხვი, რომელიც ნაკლებია ან გათანაბრებულია 10-თან.

for i in range(11):
    print(i)
    if i < 10:
        print(" ათზე ნაკლებია. ")
    elif i == 10:
        print(" ტოლია ათის. ")
    else:
        print(" ათზე მეტია. ")



# 14. while loop  ის დახმარებით შეიყვანეთ რიცხვი და დაბეჭდეთ ყველა რიცხვი, 
# რომელიც გაცილებით მეტი ან ნაკლებია 10-ზე.

c8 = int(input(""))

while c8 < 10:
    print(c8)
    c8 = c8 + 1


while c8 > 10:
    print(c8)
    c8 = c8 - 1



# 15. შეიყვანეთ რიცხვი და დაბეჭდეთ ყველა რიცხვი, რომელიც ნაკლებია შეყვანილ რიცხვზე.

c9 = int(input(""))

i = 1
while i > c9:
    print(i)
    i = i - 1



# 16. შეიყვანეთ რიცხვი და დაბეჭდეთ მისი ყველა წყვილი რიცხვი (მაგალითად, 8 -> 2, 4, 6, 8).

c10 = int(input(""))

if c10 % 2 == 1:
    c10 = c10 - 1

while c10 > 0:
    print(c10)
    c10 = c10 - 2



# 17. შეიყვანეთ რიცხვი და დაბეჭდეთ მისი ყველა რიცხვი, რომელიც ნაკლებია 10-ზე.

c11 = int(input(""))

while c11 >= 10:
    print(c11)
    c11 = c11 - 1



# 18. შეიყვანეთ რიცხვი და გამოიყენეთ while ციკლი, რომ შეამოწმოთ, არის თუ არა რიცხვი დადებითი.

c12 = int(input(""))

while c12 > 0:
    print(" დადებითი. ")

while c12 < 0:
    print(" უარყოფითი. ")

while c12 == 0:
    print(" არც დადებითია, არც უარყოფითი. ")



# 19. შეიყვანეთ რიცხვი და დაბეჭდეთ ყველა რიცხვი, რომელიც არის 3-ზე მეტია, მაგრამ 10-ზე ნაკლები.

c13 = int(input(""))

while c13 > 3 and c13 < 10:
    print(c13)

c13 = c13 - 1