# 1. თუ ასაკი არის 18 ის ზემოთ ან 50 წლის ქვემოთ ან თუ ასაკი ნაკლებია 18 ზე და მეტია 50 ზე,
# გამოტანეთ ის უნდა იყოს ან მოხუცი ან ახალგაზრდა

age = 20


if age < 50:
    print(" ახალგაზრდა.")
if age > 50:
    print(" მოხუცი.")


# age = 20

# print(age > 18 and age < 50)


# 2. გამოიყენეთ or ოპერატორი, რათა შეამოწმოთ, 
# თუ მოცემული ციფრები არიან 10-ზე მეტი ან 50-ზე ნაკლები.

#num1 = 20

#print(num1 > 10 or num1 < 50)


# 3. შეამოწმეთ, არის თუ არა მოცემული ციფრი დადებითი ან ნული, 
# თუმცა არ არის უარყოფითი.

num2 = 1

print(num2 >= 0)


# 4. გამოიყენეთ or  რათა გაიგოთ  თუ ცხოველი არის , კატა თუ თაგვი.

animal =(input(" "))

print(animal == " cat " or " mouse " )                    

# 5. შეამოწმეთ, თუ ერთ-ერთი ციფრი უფრო დიდია 10-ზე ან მეორე ციფრი ნაკლებია 50-ზე.

num3 = 15
num4 = 45

print(num3 > 10)

print(num4 < 50)

# 6. შეამოწმეთ შეყვანილი სიტყვა hello-ა თუ hello world.

c = (input("   "))
print(c == " hello " or " hello world ")                    


# 7. ახსენით კომენტარებით ყველა დავალება

# პირველ დავალებაში if ფუნქცია გამოვიყენე, რადგან მქონდა ორი პირობა ჩასაწერი, 
# და print ფუნქცია შევწიე შიგნით, რადგან ეს print ფუნქცია მიეკუთვნება ამ if- ს.

# მეორე დავალებაში ცვლადს მივანიჭე მნიშვნელობა, მოცემული ციფრი უნდა შემედარებინა 10- ს და 50-ს
# და print ფუნქციაში ჩავწერე < და > ნიშნები, რომ შემემოწმებინა ჩემი ჩაწერილი რიცხვი მოხვდა თუ არა
# 10- სა და 50- ს შორის.

# მესამე დავალებაში გამოვიყენე >=, ანუ მაინტერესებდა 1 მეტი იყო თუ ტოლი 0- ის.


# მეხუთე დავალებაში ორი ციფრი: 15 და 45 შევადარე 10-ს და 50- ს.
