


# 1) შექმენით ფუნქცია რომელსაც ექნება ორი პარამეტრი 
# ხოლო ამ ფუნქციამ უნდა გადაამრავლოს ეს ორი რიცხვი ერთმანეთზე 
# შემდეგ კი დაიბეჭდოს მიღებული ნარმავლი ლუწია თუ კენტი ნამრავლთან ერთად, 
# გამოიძახეთ ეს ფუნქცია რამდენჯერმე და გადაეცით არგუმენტები(სვადასვა რიცხვები)


def multiply(number, integer):
    c1 = int(input(''))
    c2 = int(input(''))
    ans = (c1 * c2)
    if ans % 2 == 0:
        print('even')
    elif ans % 2 != 0:
        print('odd')
    else:
        print('nor even or odd')

multiply()