# 1)შექმენით ორი განსხვავებული ცვლადი ერთში შეიყვანთ თქვენს სახელს ხოლო მეორეში თქვენს გვარს 
# შემდეგ კი თითოეული მათგანი დაპრინტეთ შემდეგ კი კომენტარების დახმარებით (#) ახსენით თქვენი დაწერილი კოდი

name = "qetevan"
lastname = "makharashvili"
print(name)
print(lastname)

# აქ მე ცვლადების გამოყენებით (name და lastname) შევქმენი კოდი, სადაც წერია ჩემი სახელი და გვარი.
# შემდეგ კი print-ით დავბეჭდე ტერმინალში.


# 2) შექმენით რამდენიმე ცვლადი სადაც შეინახავთ თქვენს შესახებ ინფორმაციას
age = 16
nationality = "georgian"
print(age)
print(nationality)


# 3) გამოიტანეატ ტერმინალში თქვენს შესახებ იფნორმაცის ცვლადების დახმარებით ერთ გრძელ წინადადებად

# ტერმინალში გამოიტანა : qetevan makharashvili, 16, georgian.


# 4) კომენტარებით ახსენით თუ როგორ ვქმნით ცვლადს და რა არის მისი დანიშნულება

# ცვლადი იწერება მარცხნივ, ხოლო მნიშვნელობა, რომლის შენახვაც გსურთ ცვლადში - მარჯვნივ,
# და შუაში ეწერება "+" ნიშანი.