# 1. მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი ერთიდან ამ რიცხვამდე დაბეჭდეთ ყველა რიცხვის ჯამი

c1 = int(input(""))

sum1 = 0
i = 0
while i < 50:
    sum = sum + i

    i = i + 1
print(sum)



# 2. მომხმარებელს შემოატანინეთ რიცხვი 
# შემდეგ კი ერთიდან ამ რიცხვამდე დაბეჭდეთ რიცხვების საშუალო არითმეტიკული

c2 = int(input(""))

sum2 = 0
for i in range(1, c2 + 1):
    sum = sum + i

print(sum / c2)



# 3. მომხმარებელს შემოატანინეთ რიცხვი 
# შემდეგ კი ერთიდან ამ რიცხვამდე დაბეჭდეთ ყველა რიცხვის კვადრატის ჯამი

c3 = int(input(""))

sum3 = 0
i = 0
while i < 50:
    sum = sum + i

    i = i + 1
print(sum * i)



# 4. მომხმარებელს შემოატანინეთ რიცხვი 
# შემდეგ კი ერთიდან ამ რიცხვამდე დაბეჭდეთ ყველა რიცხვის ორზე ნამრავლების ჯამი

c4 = int(input(""))

for i in range(1, c4):
    print(i * 2 + i)



# 5. მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი ერთიდან ამ რიცხვამდე დაბეჭდეთ ყველა რიცხვის ნამრავლი

c5 = int(input(""))

sum4 = 0

for i in range(1, c5):
    c5 = c5 * i

print(sum4)