# python:
# 1) შექმენით სია, სადაც ჩამოწერთ თქვენ გაკეთებულ პროექტებს. 
# თქვენი დავალებაა რომ დაბეჭდოთ დასაწყისი და ბოლო ინდექსი წინადადებაში 
# "ჩემი პირველი პროექტი რაც გავაკეთე არის {სიის პირველი ინდექსი}
#  და ჩემი ბოლო პროექტი კი არის {სიის ბოლო ინდექსი}"


project_list = ["chatbot", "website"]

print("my first project was" + ": " + project_list[0])
print("my last project was" + ": " + project_list[1])


# 2) შექმენით სია, სადაც გექნებათ რიცხვები 1-იდან 10-ის ჩათვლით. 
# თქვენი დავალებაა რომ ამ სიიდან აირჩიოთ ორი ინდექსი და შეკრიბოთ

number_list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

c1 = int(input(""))
c2 = int(input(""))

print(c1 + c2)



# 3) შექმენით სია, სადაც გექნებათ 1-იდან 20-ის ჩათვლით რიცხვები. 
# თქვენი დავალებაა რომ ამ სიიდან აირჩიოთ ორი ინდექსი 
# და გამოიყენოთ for loop-ი რომ 1 ინდექსიდან 2 ინდექსამდე ჩამოთვალოს ციფრები


number_list2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

c3 = int(input(""))
c4 = int(input(""))

for i in range(c3, c4):
    print(i)




# 4) შექმენით სია, სადაც გექნებათ 1-იდან 30-ის ჩათვლით რიცხვები. 
# თქენი დავალებაა რომ ამ სიიდან აირჩიოთ ერთი ინდექსი, 
# მომხმარებელმა კი უნდა შეიყვანოს ის ინდექსი რომელიც თქვენ აირჩიეთ. 
# გამოიყანეთ while loop-ი იმისთვის რომ თუ მომხმარებელმა არ შეიყვანა ის ინდექსი რომელიც თქვენ აირჩიეთ,
#  დაბეჭდოთ მესიჯი "Incorrect, Please try again" და ახლიდან მოსთხოვოს რიცხვის შეყვანა. 
# სხვა შემთხვევაში თუ მომხმარებელმა შეიყვანა ინდექსი რომელიც თქვენ აირჩიეთ,  
# დაბეჭდეთ "You guessed the number!". სხვა შემთხვევაში თუ მომხმარებლის შეყვანილი რიცხვი არის მეტი 30-ზე,
#  ამოუგდოს მესიჯი "Incorrect, You must enter a number from 1 to 30"


number_list3 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 
                31, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 
                21, 22, 23, 24, 25, 26, 27, 28, 29, 30]

index_number = number_list3[23]

c5 = int(input(""))

if  c5 > 30:
    print("incorrect, please enter number from 1 to 30.")                                    
elif c5 != number_list3[23]:
    print("incorrect, please try agian.")
elif c5 == number_list3[23]:
   print("correct, you guessed the number.")
else:
    print("incorrect, please try again")



# 5) გააკეთეთ 2 დავალების მზგავსი რამ, მაგრამ უნდა იყოს ეხლა ორი რიცხვის ნამრავლი

number_list4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

c6 = int(input(""))
c7 = int(input(""))

print(c6 * c7)