# 1. მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი შეამოწმეთ ეს რიცხვი არის თუ არა სამის ჯერადი


num = int(input(" "))

if num % 3 == 0:
     print(" სამის ჯერადია. ")
else:
     print(" არ არის სამის ჯერადი. ")



# 2. მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი შეამოწმეთ ეს რიცხვი არის თუ არა ხუთის ჯერადი


num2 = int(input(" "))

if num2 % 5 == 0:
     print(" ხუთის ჯერადია. ")
else:
     print(" არ არის ხუთის ჯერადი. ")



# 3. მომხმარებელს შემოატანინეთ რიცხვი შემდეგ კი დაბეჭდეთ ეს რიცხვი უარყოფითია თუ დადებითი


num3 = int(input(" "))

if num3 > 0:
     print(" დადებითია. ")
elif num3 < 0:
     print(" უაროფითია. ")
else:
     print(" არც უარყოფითია, არც დადებითი. ")



# 4. დაბეჭდეთ ნულიდან 50 მდე მხოლოდ ლუწი რიცხვები 

for i in range(50):
     if i % 2 == 0:
         print(i)



# 5. დაბეჭდეთ ნულიდან 30 მდე მხოლოდ კენტი რიცხვები

for i in range(30):
     if i % 2 == 0:
       print(str(i + 3))




# 6. დაბეჭდეთ ნულიდან 70 მდე რიცხვები ლუწ რიცხვებს გვერძე მიუწერეთ რომ ლუწია 
# ხოლო კენტებს მიუწერეთ რომ კენტია

for i in range(70):
     if i % 2 == 0:
        print(str(i + " ლუწია. "))
     else:
        print(" კენტია. ")



# 7. დაბეჭდეთ 0 დან 100 მდე მხოლოდ ხუთის ჯერადი რიცხვები

for i in range(100):
     if i % 5 == 0:
         print(i)



# 8. დაბეჭდეთ 0 დან 50 მდე მხოლოდ სამის ჯერადი რიცხვები

for i in range(50):
     if i % 3 == 0:
         print(i)



# 9. მომხმარბელს შემოატანინეთ რიცხვი შემდეგ კი მომხმარებლის შემოტანილ რიცხვამდე დაბეჭდეთ ყველა რიცხვი

num4 = int(input(" "))

for i in range(num4):
     print(i)



# 10. მომხმარბელს შემოატანინეთ რიცხვი 
# შემდეგ კი მომხმარებლის შემოტანილ რიცხვამდე დაბეჭდეთ მხოლოდ ლუწი რიცხვები

num5 = int(input(" "))
for i in range(num5):
     if i % 2 == 0:
       print(i)



#  11. მომხმარბელს შემოატანინეთ რიცხვი 
# შემდეგ კი მომხმარებლის შემოტანილ რიცხვამდე დაბეჭდეთ მხოლოდ კენტი რიცხვები

num6 = int(input(" "))

for i in range(num6):
     if i % 2 != 0:
       print(i)



#  12. მომხმარბელს შემოატანინეთ რიცხვი 
# შემდეგ კი მომხმარებლის შემოტანილ რიცხვამდე დაბეჭდეთ რიცხვები და გვერძე მიუწერეთ ლუწია თუ კენტი

num7 = int(input(" "))

for i in range(num7):
     if i % 2 == 0:
         print(str(i) + " ლუწია. ")
     else:
         print(str(i) + " კენტია. ")



#  13. მომხმარბელს შემოატანინეთ რიცხვი 
# შემდეგ კი მომხმარებლის შემოტანილ რიცხვამდე დაბეჭდეთ მხოლოდ ხუთის ჯერადი რიცხვები 

num8 = int(input(" "))
for i in range(num8):
    if i % 5 == 0:
       print(num8)