

#  2)  მომხმარებელს შეეკითხეთ სახელი შემდეგ შექმენით ფუნქცია რომელსაც ექნება ერთი პარატემტრი 
# რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი სახელი შემდეგ კი მას მიესალმება



def user_name(name):
    name1 = input('')
    print('hello, ' + name1)

user_name('qeta')





#  3) მომხმარებელს შეეკითხეთ ორი რიცხვი შემდეგ შექმენით ფუნქცია 
# რომელსაც ექნება ორი პარატემტრი 
# რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვები შემდეგ კი დაბეჭდავს მათ ჯამს 


def random_number(num1, num2):
    num1 = int(input(''))
    num2 = int(input(''))
    print(num1 + num2)

random_number(1, 2)



#  4) მომხმარებელს შეეკითხეთ ორი რიცხვი შემდეგ შექმენით ფუნქცია 
# რომელსაც ექნება ორი პარატემტრი 
# რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვები შემდეგ კი დაბეჭდავს მათ განაყოფს


def random_num2(num3, num4):
    num3 = int(input(''))
    num4 = int(input(''))
    print(num3 / num4)

random_num2(3, 4)



# 5) მომხმარებელს შეეკითხეთ ორი რიცხვი შემდეგ შექმენით ფუნქცია 
# რომელსაც ექნება ორი პარატემტრი 
# რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვები შემდეგ კი დაბეჭდავს მათ ნამრავლს


def random_num3(num5, num6):
    num5 = int(input(''))
    num6 = int(input(''))
    print(num5 * num6)
random_num3(5, 6)


#  6) მომხმარებელს შეეკითხეთ ორი რიცხვი შემდეგ შექმენით ფუნქცია 
# რომელსაც ექნება ორი პარატემტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვები შემდეგ კი დაბეჭდავს მათ განაყოფს


def random_number4(num7, num8):
    num7 = int(input(''))
    num8 = int(input(''))
    print(num7 / num8)

random_number4(9)




#  7) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია 
# რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი დაბეჭდავს ეს რიცხვი ლუწია თუ კენტი


def random_number5(num9):
    num9 = int(input(''))
    if num9 % 2 == 0 :
        print(' this is even number')
    elif num9 % 2 != 0 :
        print('this number is odd')

random_number5(9)




#  8) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია 
# რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი დაბეჭდავს ეს რიცხვი დადებითია თუ უარყოფითი


def random_number6(num10):
    num10 = int(input(''))
    if num10 > 0 :
        print("this number is positive.")
    elif num10 < 0:
        print('this number is negative.')
    else:
        print('0 is neither positive')


random_number6(10)




# 9) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია 
# რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი თუ 18 ზე უთხრას რომ სრულწლოვანია თუარადა არარის


def random_Num(num11):
    num11 = int(input(''))
    if num11 >= 18:
        print('you are an adult')
    elif num11 < 18 :
        print('you are not an adult')

random_Num(22)