


# 1) შექმენით ლისტი სადაც გექნებათ 1-10 ჩათვლით რიცხვები და დაპრინტეთ მხოლოდ ლუწი რიცხვები


list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

for i in range(1, 11):
 if i % 2 == 0:
  print(i)



# 2) შექმენით ლისტი სადაც გექნებათ 1-10 ჩათვლით რიცხვები და დაპრინტეტ მოლოდ კენტი რიცხვები

list2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

for i in range(1, 10, 2):
  print(i)



# 3) შექმენით ლისტი სადაც გექნებათ 1-10 ჩათვლით რიცხვები, დაპრინტეთ ყველა რიცხვი მაგრამ მიუწერეთ რომელია კენტი და რომელია ლუწი


list3 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

#1. 
for i in range(1, 11):
    if i % 2 == 0:
        print('even')
        print(i)
    elif i % 2 != 0:
        print('odd')
        print(i)


#2. 
for i in range(1, 11):
    if i % 2 == 0 :
        print("even")
        print(i)
    else:
        print('odd')
        print(i)



# 4) შექმენით ლისტი სადაც გექნებათ 1-10 ჩათვლით რიცხვები, შეამოწმეთ რიცხვი ლუწია თუ კენტი და თუ ლუწია დაამატეთ ახალ ლისტში


list4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

even_numb = []

for i in range(1, 11):
    if i % 2 == 0:
        even_numb.append(i)
        print(even_numb)



# 5) შექმენით ლისტი სადაც გექნებათ 1-10 ჩათვლით რიცხვები, შეამოწმეთ რიცხვი ლუწია თუ კენტი და თუ კენტია დაამატეთ ახალ ლისტში


list4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

odd_numb = []

for i in range(1, 11):
     if i % 2 != 0:
         odd_numb.append(i)
         print(odd_numb)



# 6) მომხმარებელს შემოატანინეთ 5 რიცხვი და დაამატეთ ეს რიცხვები სიაში, ბოლოს გამოიტანეთ ტერმინალში ეს სია 


c1 = int(input(""))
c2 = int(input(""))
c3 = int(input(""))
c4 = int(input(""))
c5 = int(input(""))

list6 = [c1, c2, c3, c4, c5]

print(list6)



# 7) დაიწყეთ რიცხვების სიით, გამოიყენეთ while loop რომ წაშალოთ ყველა რიცხვი ამ სიიდან 
# და გამოიყენეთ pop რო დაპრინტოთ ეს ყველა ელემენტი სანამ ლისტი არ დაცარიელდება


list7 = [58, 67, 26, 84, 77, 47, 51, 86, 14, 81, 34]

while 100 > 99:
    list7.pop()
    print(list7)




# 8) შექმენით shopping სია სადაც მომხმარებელს შეეძლება რამე ნებისმიერი პროუქტის დამატება და წაშლა, 
# როდესაც მორჩებიან შოპინგს დაუპრინტეთ საბოლოოდ რა შეიძინეს 


list8 = [92, 48, 38, 47, 83, 58, 74, 35, 84, 47, 82, 45, 74, 15]

list8.remove(83)

print(list8)



# 9) გამოიყენეთ append და pop რომ დაატრიალოთ ლისტი და დაპრინტეთ შემდეგ


list9 = [84, 59, 76, 58, 79, 54, 30, 99, 59, 65, 85, 66, 38, 82, 53]

list9.append("758")

print(list9)

list9.pop(10)

print(list9)