# 1. Level 10
# მომხმარებლის სახელი
# დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს მის სახელს 
# და შემდეგ მას მიესალმება.

name = int(input(" enter your name: "))
print(" hello " + str(name))


# 2. მოცემული რიცხვის გამრავლება 10-ზე  
# დაწერე პროგრამა, რომელიც მომხმარებელს შემოატანინებს რიცხვს, 
# დაპრინტავს ჯერ ამ რიცხვს და შემდეგ ამ რიცხვის ნამრავლი 10-ზე.

num1 = int(input(" enter your number: "))
num2 = (num1 * 10)
print(num1)
print(num2)


# 3. ორი რიცხვის გამოკლება
# დაწერე პროგრამა, რომელიც შემოატანინებს მომხმარებელს ორი რიცხვს 
# და დაბეჭდავს მათ სხვაობას.
    
num3 = int(input(" enter your number: "))
num4 = int(input(" enter your number: "))
print(num3 - num4)


# 4. სახელი და ასაკი
# დაწერე პროგრამა, რომელიც მომხმარებელს შემოატანინებს სახელს და გვარს 
# და დაპრონტავს ამ ორ მონაცემს ასეთი ფორმატით: "თქვენი სახელია X ხოლო თქვენ ხართ Y წლის"
    
user_name = int(input(" enter your name: "))
user_lastname = int(input(" enter your lastname: "))
print(" your name is" + user_name + user_lastname)



# 5. მეგობრის სახელის შემოტანა 
# დაწერე პროგრამა, რომელიც შემოატანინებს მომხმარებელს მისი საუკეთესო მეგობრის სახელს და გვარს 
# და დაპრინტავს ასეთი ფორმატით: "თქვენი მეგობრის სახელია X ხოლო გვარია Y".





# 6. ციფრის გამრავლება 2-ზე 
# დაწერე პროგრამა, რომელიც მომხმარებელს შემოატანინებს რიცხვს, დაპრინტავს ჯერ ამ რიცხვს 
# და შემდეგ ამ რიცხვის ნამრავლი 2-ზე.
    
num5 = int(input(" enter your number: "))
print(num5)
print(num5 * 2)



# 7. საყვარელი ფერი 
# დაწერე პროგრამა, რომელშიც მომხმარებელი შემოიტანს მის საყვარელ ფერს 
# და დაბეჭდავს ასეთი ფორმატით: "შენი საყვარელი ფერი არის X".

color = int(input(" enter your favorite color: "))
print("your favorite color is" + color)



# 8. ქალაქის შემოტანა 
# დაწერე პროგრამა, რომელშიც მომხმარებელი შემოიტანს ქალაქს სადაც ცხოვრობს, 
# შემდეგ კი გამოიტანს ასეთი ფორმატით: "შენ ცხოვრობ ქალაქში სახელად x"

city1 = int(input(" enter your city: "))
print("you live in " + city1)