# 1. მომხმარებელს შემოატანინეთ ორი რიცხვი და მათზე მოახდინეთ მათემატიკური ოპერაციები.

num = int(input(" enter number 1: "))
num2 = int(input(" enter number 2: "))

print(num < num2)

print(num > num2)

print(num == num2)

print(num != num2)


# 2. მოიყვანეთ 10 მაგალითი შედარების ოპერატორებზე ==, !=, >, <, =<, =>.

45 == 66
100 == 100
334 != 334
900 != 12
23 > 24
24 > 23
50 < 500
500 < 50
44 <= 88
99 <= 338
378 >= 7123
67 >= 11


# 3. მომხმარებელს შემოატანინეთ თავისი სახელი, გვარი ასაკი, და შემდეგ შეაერთეთ ისე,
# რომ გამოვიდეს წინადადება

name = (input(" enter your name: "))

lastname = (input(" enter your lastname: "))

age = (input(" enter your age: "))

print(" name and lastname " + name + " " + lastname + ". " + age + " years old.")


# 4. ახსენით, რა განსხვავებაა ამათ შორის: !=, ==, ახსენით კომენტარებით.

# " != " ნიშნავს, რომ რაღაც არ უდრის მეორეს, თუ " ! " უწერია წინ რამეს მაშინ უარყოფაა.
# " == " არის შედარების ოპერატორი, თუ ერთი მეორეს ტოლია, მაშინ true- ს გამოიტანს, თუ არ არის ტოლი,
# მაშინ false- ს.

# 5. მომხმარებელს შემოატანინეთ სახელი, გვარი, ასაკი, საცხოვრებელი ადგილი.

name2 = (input(" enter your name: "))

lastname2 = (input(" enter your lastname: "))

age2 = (input(" enter your name: "))

city = (input(" enter your city: "))

# 6. კომენტარებით ახსენით რასაც გააკეთებთ ყველაფერი.

# პირველ დავალებაში, input ფუნქციით დავწერე ორი რიცხვი, და შევადარე.

# მეორე დავალებაში 18 რიცხვი ერთმანეთს შევადარე (ორჯერ მიწერია ზოგიერთი რიცხვი).

# მესამე დავალებაში input ფუნქციით ჩავწერე წინადადებები, და space- თი დავაშორე ერთმანეთს.
# ეს შემოტანილი სიტყვები " + "- ით გადავაბი, და space ჩავსვი სიტყვებს შორის.

# მეოთხე დავალებაში " != " და " == " ავხსენი რას ნიშნავს

# მეხუთე დავალებაში ოთხი input ფუნქცია გამოვიყენე და ჩავწერე.


# 7. მომხმარებელს შემოატანინეთ 2 რიცხვი, და შემდეგ გამოიყენეთ შედარების ოპერატორები 
# რა რიცხვსაც შეიყვანს მომხმარებელი, მასე გამოიყენეთ შედარების ოპერატორები: ==, !=, <, >, <=, =>.

num3 = int(input(" enter your number 1: "))
num4 =  int(input(" enter your number 2: "))

print(num3 == num4)

print(num3 != num4)

print(num3 < num4)

print(num3 > num4)

print(num3 <= num4)

print(num3 >= num4)