# 2) შექმენით სია, რომელშიც მოათავსებთ 8 სხვადასხვა ხილის სახელს "ქართულს".

# 1. დაბეჭდეთ მესამე და მეშვიდე ელემენტები.
# 2. დაბეჭდეთ პირველი ოთხი ელემენტი.
# 3. დაბეჭდეთ ბოლო სამი ელემენტი.



# list1 = ["vashli", "msxali", "atami", "yurdzeni", "sazamtro", "alubali", "bali", "nesvi" ]

# print(list1[3] + ", " + list1[7])


# print(list1[1:5])


# print(list1[5:])




# 3) შექმენით სია, რომელშიც მოათაავსებთ 6 სხვადასხვა ქალაქის სახელს.

# 1. დაბეჭდეთ მეორე და მეექვსე ელემენტები.
# 2. დაბეჭდეთ შუა ორი ელემენტი.
# 3. დაბეჭდეთ სათითაოდ სია  არეული თანმიმდევრობით.


# city_list = ["paris", "london", "new york", "tokyo", "rome", "madrid"]

# print(city_list[2] + ", " + city_list[5])

# print(city_list[2] + ", " + city_list[3])



# 5) შექმენით სია რომელშიც გექნებათ 1 დან 20მდე რიცხვები შემდეგ კი დაბეჭდეთ 3 ის ჯერადი რიცხვები


number_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

print(number_list[2], number_list[5], number_list[8], number_list[11], number_list[14], number_list[17])