# 1. მომხმარებელს შემოატანინეთ თავიანთი სახელი, 
# თუ ეს სახელი ემთხვევა თქვენს სახელს დაუპრინტეთ რომ ერთნაირი სახელები გაქვთ,
# სხვა შემთხვევაში დაუპრინტეთ რომ სასიამოვნოა მათი გაცნობა.

name = (input(" "))

if name == "ქეთევან":
   print("ჩვენ გვაქვს ერთნაირი სახელები.")
else:
  print("სასიამოვნოა თქვენი გაცნობა.") 



# 2. მომხმარებელს შემოატანინეთ ასაკი, გაარკვიეთ მას შეუძლია თუ არა მართვის მოწმობის აღება 
# (17 წლის უნდა იყო მართვის მოწმობის აღება რომ შეგეძლოს). თუ შეუძლია უთხარით 
# რომ ის დიდი ბიჭი ან გოგოა, თუ არა დაუპრინტეთ რომ მალე გაიზრდება.

age = int(input(" "))

if age >= 17:
   print("თქვენ შეგიძლიათ აიღოთ მართვის მოწმობა.")
else:
   print("თქვენ ვერ შეძლებთ მართვის მოწმობის აღებას.")




# 3. შეადარეთ თქვენი ასაკი მომხმარებლის შემოტანილ ასაკს, 
# თუ თქვენი ასაკი მეტია მომხმარებლის ასაკზე უთხარით რომ თქვენ მასზე დიდი ხართ, 
# თუ მასზე პატარა ხართ დაუპრინტეთ რომ მასზე პატარა ხართ 
# და სხვა შემთხვევაში დაუპრინტეთ რომ ტოლები ხართ.

age2 = int(input(" "))

if age2 > 16:
   print("თქვენ ჩემზე უფროსი ხართ.")
elif age2 < 16:
   print("თქვენ ჩემზე უმცროსი ხართ.")
else:
   print("ჩვენ ტოლები ვართ.")

# 4. გიორგიმ შექმნა ზოოპარკი სადაც შესვლა მხოლოდ კონკრეტული აღნაგობის ხალხს შეუძლიათ. 
# გიორგი ზოოპარკში უშვებს ხალხს რომელიც 180 სანტიმეტრზე მაღლები არიან და 
# 50-90 კილოს შორის არიან წონით. 
# თქვენი მისიაა რომ მომხმარებელს შემოატანინოთ წონა და სიმაღლე და გაარკვიოთ 
# შეუძლია თუ არა მომხმარებელს ზოოპარკის მონახულება.

height = float(input(" "))

weight = float(input(" "))

if height >= 180 or weight > 50 and weight < 90:
   print("თქვენ შეგიძლიათ ზოოპარკში შესვლა.")
else:
    print("თქვენ არ შეგიძლიათ ზოოპარკში შესვლა.")




# 5. დედამ გაგიშვათ აფთიაქში თავის ტკივილის წამლის საყიდლათ, 
# ეს წამალი დღეში უნდა დალიო შენი წონის მიხედვით. 
# თუ 10 დან 20 კილომდე ხარ ნახევარი ტაბლეტი უნდა დალიო დღეში, 
# თუ 30-40 კილომდე ხარ 1 ტაბლეთი ორჯერ დღეში 
# და თუ 45 კილოზე მეტი ხარ სამი ტაბლეტი უნდა დალიო ორჯერ დღეში. 
# თქვენი მისიაა ამ ინფორმაციით გაარკვიოთ მომხარებელს 
# რამდენი წამალი აქვს დასალევი და დღეში რამდენჯერ უნდა დალიოს.

weight2 = float(input(" "))

if weight2 > 10 and weight2 < 20:
   print("შენ უნდა დალიო ნახევარი ტაბლეტი დღეში.")
elif weight2 > 30 and weight2 < 40:
   print("შენ უნდა დალიო ერთი ტაბლეტი ორჯერ დღეში.")
elif weight2 > 45:
   print("შენ უნდა დალიო სამი ტაბლეტი ორჯერ დღეში.")



# 6. თქვენ დაგპატიჟეს პატარა ბავშვის დაბადების დღეზე გასართობ ცენტრში, 
# თქვენთან ერთად ამ გასართობ ცენტრში დაპატიჟეს 10 ადამიანი და ამ 10 ადამიანიდან ერთ ერთი ნიკოლოზია. 
# ნიკოლოზს უთხრეს რომ მას შეუძლია ბავშებთან ერთად გაერთოს 
# თუ ის ფეხსაცმელებს გაიხდის და ქურთუკს საკიდზე ჩამოკიდებს (True და False-ს გამოყენება დაგჭირდებათ). 
# თქვენი მიზანია გაარკვიოთ ნიკოლოზმა შეასრულა ეს წესები თუ არა, 
# ანუ შეუძლია თუ არა მას ბავშებთან ერთად გართობა.

f = (input(" "))

if f == "მან ჩამოკიდა ქურთუკი და გაიხადა ფეხსაცმელი.":
   print("მას შეუძლია თამაში.")
else:
   print("მას არ შეუძლია თამაში.")



# 7. დედამ გაგიშვათ მაღაზიაში რადგან გენახათ მათ ჰქონდათ თუ არა მინერალური წყალი. 
# თუ მაღაზიას აქვს მინერალური წყალი, დედას უთხარით რომ მაღაზიაში მინერალური წყალი აქვთ, 
# თუ არ უდევთ დახლებზე მაშინ უთხარით რომ აღარ აქვთ.

m = (input(" "))

if m == "არის მინერალური წყალი.":
    print("მაღაზიაში აქვთ მინერალური წყალი.")
else:
    print("არ აქვთ მაღაზიაში მინერალური წყალი.")