# 1)
# a = 5
# b = "10"
# result = a + b
# print("Result:", result)
# კოდი გამოიტანს ერორს 
# დაწერეთ რატომ და ასევე ცალკე დაწერეთ სწორი ფორმა

a = 5
b = "10" # (string)
result = a + b
print(result)    # ერორს დაწერს, რადგან ჩვენ სტრინგიანი ცვლადი
                 # "result" არ გვაქვს, რომ დავპრინტოთ.


# 2)
# value = "10"
# result = value * 5
# print("Result:", result)
#გაიხსენეთ მონაცემთა ტიპები და შეასწორეთ ეს კოდი

# სწორი ფორმა:
value = "10"
result = value * 5
print(result)   # string, integer, float.


# 3)რა 3 ნაწილისგან შედგება კოდის წერის პროცესი 
# #(პასუხი დაასაბუთეთ)

# კოდის წერის პროცესი შედგება 
# #1. ცვლადით, 2. print ფუნქციით, 3. ?.


# 4)რა არის debugging აღწერეთ დეტალურად ეს პროცესი

# debugging არის, როდესაც რამე კოდს დაწერ, სისტემა ერორს
# ამოაგდებს, და მაგ ერორს გაასწორებ.


# 5)
# num1 = 6
# num2 = 8
# num3 = 10
# average = num1 + num2 + num3 / 3
# print("Average:", average)

# შეასწორეთ კოდი ისე რომ 
# საშუალო არითმეტიკული სწორად გამოითვალოს

num1 = 6
num2 = 8
num3 = 10
average = (num1 + num2 + num) / 3
print(average)