

# 1)შექმენით სია, რომელიც შეიცავს 5 სხვადასხვა ცხოველის სახელს. 
# გამოიტანეთ პირველი და ბოლო ცხოველის სახელი ინდექსების გამოყენებით.

list1 = ["ლომი", "ძაღლი", "კატა", "თაგვი", "ირემი"]

print(list1[0] + ", " + list1[4])




# 2)შექმენით სია, რომელიც შეიცავს 10 რიცხვს. 
# გამოიტანეთ სიის პირველი 5 ელემენტი და ბოლო 5 ელემენტი ინდექსების გამოყენებით.


list2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

print(list2[0:6])
print(list2[6:])


# 3)შექმენით სია, რომელიც შეიცავს 6 რიცხვს. 
# გამოიტანეთ სიის ელემენტების ჯამი და საშუალო მნიშვნელობა.

list3 = [1, 2, 3, 4, 5, 6,]

print(list3[0] + list3[1] + list3[2] + list3[3] + list3[4] + list3[5] / 6)



# 4)შექმენით სია, რომელიც შეიცავს 8 სხვადასხვა ქალაქის სახელებს. 
# წაშალეთ მესამე და მეხუთე ქალაქის სახელი და გამოიტანეთ განახლებული სია.


list4 = ["tbilisi", "new york", "tokyo", "chicago", 
         "paris", "rome", "barcelona", "singapore"]

list4.remove("tokyo")
list4.remove("paris")

print(list4)



# 5)შექმენით სია, რომელიც შეიცავს 10 რიცხვს. 
# შექმენით ახალი სია, რომელიც შეიცავს მხოლოდ სიის ელემენტების პირველ ნახევარს.

list5 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

list6 = list5[0:5]

print(list5, list6)